{
  "architectures": ["GptOssForCausalLM"],
  "attention_bias": true,
  "attention_dropout": 0.0,
  "eos_token_id": 200002,
  "head_dim": 64,
  "hidden_act": "silu",
  "hidden_size": 2880,
  "initializer_range": 0.02,
  "intermediate_size": 2880,
  "layer_types": [
    "sliding_attention", "full_attention",
    "sliding_attention", "full_attention",
    "sliding_attention", "full_attention",
    "sliding_attention", "full_attention",
    "sliding_attention", "full_attention",
    "sliding_attention", "full_attention",
    "sliding_attention", "full_attention",
    "sliding_attention", "full_attention",
    "sliding_attention", "full_attention",
    "sliding_attention", "full_attention",
    "sliding_attention", "full_attention",
    "sliding_attention", "full_attention"
  ],
  "model_type": "gpt_oss",
  "num_attention_heads": 64,
  "num_experts_per_tok": 4,
  "num_hidden_layers": 24,
  "num_key_value_heads": 8,
  "num_local_experts": 32,
  "pad_token_id": 199999,
  "rms_norm_eps": 1e-05,
  "rope_scaling": { "rope_type": "default", "rope_theta": 150000 },
  "sliding_window": 128,
  "swiglu_limit": 7.0,
  "tie_word_embeddings": false,
  "torch_dtype": "bfloat16",
  "vocab_size": 201088
}
